# 引入Taiwan_Stock_2022和Taiwan_Stock_2023數據 -----
library(tidyverse)

# 讀取2022年的股票數據
stock_2022 <- read_csv("data/Taiwan_Stock_2022.csv", locale = locale(encoding = "Big5"))

# 讀取2023年的股票數據
stock_2023 <- read_csv("data/Taiwan_Stock_2023.csv", locale = locale(encoding = "Big5"))

# 顯示前3行以檢查數據
glimpse(stock_2022)
glimpse(stock_2023)

# 建立 BATS30_2022 -----
BATS30_2022 <- stock_2022 %>%
  filter(`財務結構-負債佔資產比率(%)` < 65,
         `償債能力-流動比率(%)` > 100,
         `經營能力-應收款項週轉率(次)` > 4.5,
         `經營能力-存貨週轉率(次)` > 3,
         `經營能力-總資產週轉率(次)` > 0.4,
         `獲利能力-純益率(%)` > 1.1,
         `獲利能力-每股盈餘(元)` > 1.5,
         !str_detect(`公司簡稱`, "KY")) %>%
  top_n(30, `獲利能力-權益報酬率(%)`) %>%
  select(`公司代號`, `公司簡稱`, `財務結構-負債佔資產比率(%)`, `償債能力-流動比率(%)`,
         `經營能力-應收款項週轉率(次)`, `經營能力-存貨週轉率(次)`, `經營能力-總資產週轉率(次)`,
         `獲利能力-權益報酬率(%)`, `獲利能力-純益率(%)`, `獲利能力-每股盈餘(元)`)

# 建立 BATS30_2023 -----
BATS30_2023 <- stock_2023 %>%
  filter(`財務結構-負債佔資產比率(%)` < 65,
         `償債能力-流動比率(%)` > 100,
         `經營能力-應收款項週轉率(次)` > 4.5,
         `經營能力-存貨週轉率(次)` > 3,
         `經營能力-總資產週轉率(次)` > 0.4,
         `獲利能力-純益率(%)` > 1.1,
         `獲利能力-每股盈餘(元)` > 1.5,
         !str_detect(`公司簡稱`, "KY")) %>%
  top_n(30, `獲利能力-權益報酬率(%)`) %>%
  select(`公司代號`, `公司簡稱`, `財務結構-負債佔資產比率(%)`, `償債能力-流動比率(%)`,
         `經營能力-應收款項週轉率(次)`, `經營能力-存貨週轉率(次)`, `經營能力-總資產週轉率(次)`,
         `獲利能力-權益報酬率(%)`, `獲利能力-純益率(%)`, `獲利能力-每股盈餘(元)`)

# 檢查 BATS30_2022 和 BATS30_2023 的前3行以確認
glimpse(BATS30_2022)
glimpse(BATS30_2023)

# 在 BATS30_2023 中新增 "營收-權益比" 行
BATS30_2023 <- BATS30_2023 %>%
  mutate(`營收-權益比` = `獲利能力-權益報酬率(%)` / `獲利能力-純益率(%)`)

# 檢查新增的行
glimpse(BATS30_2023)

# 將BATS30_2022中的獲利能力-權益報酬率(%)加入BATS30_2023中
BATS30_2023 <- BATS30_2023 %>%
  mutate(`ROE growth` = `獲利能力-權益報酬率(%)` / BATS30_2022$`獲利能力-權益報酬率(%)`)

# 檢查新增的行
glimpse(BATS30_2023)

# 重新排序 BATS30_2023 以取得 ROE growth 前五的公司
BATS5_2023 <- BATS30_2023 %>%
  arrange(desc(`ROE growth`)) %>%
  slice(1:5) %>%
  select(`公司簡稱`, `公司代號`)

# 檢視 BATS5_2023
BATS5_2023
